Revit 2027 API
CurveLoop.Create Method
 Creates a new curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CurveLoop Create(
	IList<Curve> curves
)
Public Shared Function Create (
	curves As IList(Of Curve)
) As CurveLoop
public:
static CurveLoop^ Create(
	IList<Curve^>^ curves
)
static member Create :
        curves : IList<Curve> -> CurveLoop
Parameters
curves IList<Curve>
 The curves.
Return Value
CurveLoop
 The curve loop.
Exceptions
Exception | Condition
ArgumentException |  The input curves contains at least one helical curve and is not supported for this operation. -or- Throws if the input curves are not contiguous.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace